---
kind: type
id: T:Autodesk.Revit.DB.CurveByPointsArrayIterator
source: html/b9e33d5d-c5f1-2feb-8533-e82977da7f35.htm
---
# Autodesk.Revit.DB.CurveByPointsArrayIterator

An iterator to a CurveByPoints array.

## Syntax (C#)
```csharp
public abstract class CurveByPointsArrayIterator : APIObject,
	IEnumerator
```